---
title: FamilyPointPlacementReference
classe: Autodesk.Revit.DB.FamilyPointPlacementReference
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# FamilyPointPlacementReference

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Transform Location { get; }` | `familyPointPlacementReference.Location` | Transform |
| `String Name { get; }` | `familyPointPlacementReference.Name` | String |
| `Reference PointReference { get; }` | `familyPointPlacementReference.PointReference` | Reference |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```